

export const Data2020 = () => {
  return [
    {
      title: '2020年6-29',
      date:'2020-6-29',
      content: [
        '今天的我准备写一篇文字，纪念自己的焦虑。',
        '近期的我感到十分焦虑，总觉得自己的生活过的十分不愉快，心里空空荡荡，需要一些东西来填补，可却苦于没有伴侣，天天自怨自艾，感叹生活凄凉。',
        '仔细想了想，除了没有女朋友，其他的来说我过的也算是不错，有着还不错的工作，不错的薪资，朋友家人都挺和谐。可惜偏偏这一项，搞得我焦躁不安。我已经单身24年了，多希望有个女的能可怜可怜我，跟我谈一下恋爱。看着自己昔日的伙伴都有了伴侣，心里一边替他们开心，一边也不是滋味。我明明这么想恋爱，本身也不算太差，为什么会一直到今日都是单身呢？',
        '其实原因有很多，最主要的自己心里也很清楚，这是一个很矛盾的事，总感觉生理的那道坎真的是生物永远无法越过的一条天堑。我希望自己能拥抱它，既然跨不过去，不愿让自己太过痛苦，似乎这是一个无法挺过的痛苦，男人对性的渴求会一直到老年，可是现在的我其实已经足够痛苦了，就像发情的小猫，在小屋里面痛苦的呐喊，嚎叫。解决的方法似乎也只有绝育和找母猫两种，绝育我是万万不想的，似乎摆在我面前的就只有一条路。',
        '可亲密关系本身。。。。我有些抗拒。总是奢求有人来拯救自己，能拜托这种状况，可其实自己并没有受到青睐，我并不是知道特别能量强大的人，仅存的一点点能量全部用来保护自己了，纵使自己背下了很多情话，也有很多逗趣的小玩意儿，甚至是自己平时健身等等，也都没有用武之地。',
  
      ]
    },
    {
      title: '七月四号',
      date:'2020-7-4',
      content: [
        '我又拿起了手机，续上了上次没说完的话，间隔5天，话也变得没那么孤凉了，或许是我刚刚发泄完罢，总之心里没那么悲伤了，不过底色还是没有变化的，这几天我一直在幻想恋爱，或者是不切实际的和多位异性发生关系，每次幻想时都与平时看的电影出入很大，无论是姿势或是动作，还有女性呻吟的方式，动静没那么大，比较温柔，比较慢，比较注意细节，要是在电影里面反应出来还是需要特写以及画外音的帮助，不然像现在主流的影片都显得刻意夸张了',
        '性幻想从来没在我的脑海中完全停止过，不知什么时候开始，就一直有这个习惯。这个习惯影响了我的学习和专注能力，确实不是一个特别好的习惯，只是自己确实也克制不了，甚至无法说服自己。我或许真的不愿意去接触真正的恋爱或性爱，可却抑制不了对它的渴望，这实在是有点悲伤，悲伤的是这两者的冲突，后者克服不了，前者呢？可以尝试一下。不过自己到现在也没成功过。',
        '其实自己还算不错，也会有女生愿意做我的女朋友，在此鼓励一下自己，希望尽快能够拥有爱情。'
      ]
    },
    {
      title: '八月三日，周一，或者说是周日晚上。',
      date:'2020-8-3',
      content: [
        ' 我又拿起了手机，续上了上次没说完的话，间隔5天，话也变得没那么孤凉了，或许是我刚刚发泄完罢，总之心里没那么悲伤了，不过底色还是没有变化的，这几天我一直在幻想恋爱，或者是不切实际的和多位异性发生关系，每次幻想时都与平时看的电影出入很大，无论是姿势或是动作，还有女性呻吟的方式，动静没那么大，比较温柔，比较慢，比较注意细节，要是在电影里面反应出来还是需要特写以及画外音的帮助，不然像现在主流的影片都显得刻意夸张了',
        ' 性幻想从来没在我的脑海中完全停止过，不知什么时候开始，就一直有这个习惯。这个习惯影响了我的学习和专注能力，确实不是一个特别好的习惯，只是自己确实也克制不了，甚至无法说服自己。我或许真的不愿意去接触真正的恋爱或性爱，可却抑制不了对它的渴望，这实在是有点悲伤，悲伤的是这两者的冲突，后者克服不了，前者呢？可以尝试一下。不过自己到现在也没成功过。',
        '其实自己还算不错，也会有女生愿意做我的女朋友，在此鼓励一下自己，希望尽快能够拥有爱情。'
      ]
    },
    {
      title: '八月三日，周一，或者说是周日晚上。',
      date:'2020-8-3',
      content: [
        ' 我又拿起了手机，续上了上次没说完的话，间隔5天，话也变得没那么孤凉了，或许是我刚刚发泄完罢，总之心里没那么悲伤了，不过底色还是没有变化的，这几天我一直在幻想恋爱，或者是不切实际的和多位异性发生关系，每次幻想时都与平时看的电影出入很大，无论是姿势或是动作，还有女性呻吟的方式，动静没那么大，比较温柔，比较慢，比较注意细节，要是在电影里面反应出来还是需要特写以及画外音的帮助，不然像现在主流的影片都显得刻意夸张了',
        ' 性幻想从来没在我的脑海中完全停止过，不知什么时候开始，就一直有这个习惯。这个习惯影响了我的学习和专注能力，确实不是一个特别好的习惯，只是自己确实也克制不了，甚至无法说服自己。我或许真的不愿意去接触真正的恋爱或性爱，可却抑制不了对它的渴望，这实在是有点悲伤，悲伤的是这两者的冲突，后者克服不了，前者呢？可以尝试一下。不过自己到现在也没成功过。',
        '其实自己还算不错，也会有女生愿意做我的女朋友，在此鼓励一下自己，希望尽快能够拥有爱情。'
      ]
    },
    
    {
      title: 'the end of August',
      date:'2020-8-31',
      content: [
        '八月底，本来想着今天能伴随着the end of August写些东西，可惜现在我思绪过于零碎，并没有什么完整的东西要写，脑子里面纵使有千万条想表达的，可缺并没有一句话能写出来，即便如此，之前对自己有约定的，总归还是要实现。希望能逼自己写出一些东西吧，开始。',
        '  夏天即将结束，今年也将在此时结束上半场，由于已经离开了学校，八月底不会在让我感到有什么丝毫的不同，我不必在此时感伤暑假的结束，期待或担心新学期的到来，这一段时间会和其他时间一样，我将重复往常的工作。不过在此刻，我似乎更加对夏天的逝去有些感觉，抛去其他事件的影响，我对这个特殊的日子有了之前从未有过的感触。让我感觉下半年似乎从现在开始，主要是因为夏天结束了，一年的两个季度过去，秋天即将来临，一年的变化中最大的应该就是温度了。其他东西似乎感受不到，比如六月底，我根本感受不到它在一年中气到什么转折的作用，反而是现在，我能清楚的感受到伏天的结束，秋天正在慢慢逼近。',
        ' 开始谈谈最近的情况，我姐怀孕了，她告诉我的那一刻，我的感觉很奇妙。觉得很多事情，来的是那么的。。。怎么说呢，无法阻挡。我总以为姐姐会在明年备孕，大概是明年年底或者后年才出生。然后3年左右，他们会回武汉。我也会因此改变自己对于未来的想法，确定自己会去哪些城市。可我仔细想了想，其实我并不愿意留在或落地某一个城市，可是总有一些不可阻挡的力量，会将我绑定到某一个城市，不管是现行的政策，家人或社会的观念，或者经济形式，工作方式等等，以及婚姻。我不愿意进去，可我似乎是该为这件事做打算了，无论我如何逃避，不愿面对，人生总不会停下等我想好再前进的。就像这秋天，无论我是否做好准备，是否期待或是不情愿，它终归还是会到来。我能做的，只是如何面对它，找一个自己较为满意的姿势，去迎接或者对抗。',
        '今天就此结束吧，写的还算满意，这确实是最近自己的思绪，也算是在此刻凝结成功了，目前我依然是孑然一身，同样的，以后是会有同我度过余生的人，还是一些过客，我都应该去设想她们的到来，或许暂时还没有答案。时间到了，我该休息了。'
      ]
    },
    {
      title: '11月初',
      date:'2020-11-1',
      content: [
        '今天晚上心情十分复杂，重拾回自己的随笔，将自己的阴暗记录下来，望能自省。',
        '昨天在机缘巧合之下认识了一个94年的姐姐，以结婚为目的的介绍对象。我姐姐也希望自己的弟弟有一个恋爱的经验，需要一个开始，心情急迫下要下了那个小姐姐的微信，之后遍开始接触，从昨天晚上到今天晚上，还都处于正常的交流状态，今天晚上突然间，聊天的内容就变得越来越激烈，我一时有点恍惚。觉得有些不适。',
        '这大概就是所有的内容，表面上看起来我似乎没有什么太多的问题，似乎一切只是太快了，我适应不了所导致的问题。可事实却并非如此，在聊完天之后，我心里不是滋味，觉得自己内心深处的幽暗真的让人感到作呕！甚至现在还给自己找理由，觉得这是人的本能，大家都是这样的，保证自己的利益，这本身不算有错。',
        '在这两天，我并没有排斥去跟女生接触，心里看到照片后我姐说样貌不是主要的，我心里其实也是这么想的，可看到照片后，真的觉得样貌的重要程度似乎被我小看了，这是我内心的第一处幽暗。第二点，我感受到女生聊天过于激进后，还在迎合，甚至会按照她想的方向聊下去，我并没有及时表达自己内心的意愿。内心很不情愿，却还要调情，以致到现在心里还很难受。这是我内心幽暗的第二处。我似乎没有嘴上说的那么不在意样貌，不在意年龄，不在意家境，只在意性格，似乎并不是那么回事。直到接触到我才发现，性格并不是全部，这些全部，才是全部，性格的比例可以很高很高，可其他的地方却也是很难忽视的一点，这是我内心的第三处幽暗。自诩自己如何理想化，如何浪漫主义，到头来却发现，自己不过是一个普通，追逐利益的人罢了，并没有多么坦荡磊落。这是第四处。我没有结婚的打算，甚至没有跟她上床的打算，却也没有明确拒绝。这是第五处幽暗。自己似乎没有那么不堪，很多出发点处于不忍心拒绝，但却对自己如此厌恶，这是第六处。',
        '仔细想想似乎自己不算特别过分，或许是不愿意看见一个如此主动的女生的失望。才表现出来的意愿，而性格依然是最重要的一个标准，自己只是被突如其来的主动吓到了。一时接受不了这么快的确立关系，倒不是接受不了这个人。只是条件上没那么好。不要过于指责自己，但也不能看到这些幽暗的地方而无动于衷。我不愿抱着可怜人的心态去对待一个自己真的不喜欢的人，如果在以后的接触中觉得不合适，请及时分开，不要一种居高临下的慈悲心来对待女方，这正是我想对自己说的。'
      ]
    },
    {
      title: '2020 end',
      date:'dont now',
      content: [
        '2020已经进入尾声了，拿起键盘，记录一下这一年所发生的事情吧。',
        '2020注定是不寻常的一年，从年初到年尾，经历了很多之前没有遇到的情况，在写的时候未必有更多的感想，但是记录一下吧，放在数据库里总比放在脑子里容易保存一些。',
        '4月份疫情结束后，我到达上海，与之前的室友一起住，由于他是蛋壳的员工，所以我们就一起居住在蛋壳公寓，结果到了10月份，蛋壳出现暴雷事件，公司直接崩溃。一开始，断网，断保洁，然后是房东和租客互相争斗，网络新闻开始出现，蛋壳方还在努力压制。后来，事情闹大了，房东和租客开始互相攻击，甚至对法律的解读都有两种相反的结果，有的说房客有居住权，有的说房子是房东的，法律似乎没有办法解决这个问题。再后来，由于举报过多，贷款租金贷的微众银行发出暂缓还款，可依旧压不住广大受害者的怒火，至此，微众收到了海量的举报，我也是其中的一员。相关政策也下来了，房东无权赶走租户，不过解决的方法还没下来，这时，距蛋壳暴雷已经过去了一个月，中间发生了很多，很多租客受到了严重的打击，身上背负着几万块的租房贷，以至于后来有位刚出社会的租户跳楼自杀。12月3日，最高法院发表声明，称一定会依法办理，4日，微众发表声明，说若事情调息好后，贷款无需抵偿。16日发表声明，可完成后续操作，事情告一段落，可直至今日，全款付的租客房租依然无法要回来，估计这钱也石沉大海了。',
        '还有一件事，应该就是赛博朋克2077发售，或许是这段时间的经历和所见所闻，发现了赛博朋克似乎就在身边，以至于我第一次深刻的感受到，游戏照进现实，是多么的让人感到愤怒和无奈，我也开始对所谓的赛博朋克开始深入了解，开始入迷，但我依旧还是要吐槽一下，游戏bug太多，显然是一个半成品，希望后续能补全，我真的很喜欢这种类型的游戏，希望cdpr别让我太失望。',
        '最后一个，我依旧单身。'
      ]
    }
  ]
}

export const Data2021 = () => {
  return [
    {
      title: '2021 写给自己',
      date: 'don not',
      content: [
        '2020年终究过去，我的本命年也接近尾声，之前的许诺似乎没有完成，现在的我仍旧是形单影只，孤独的活在世界中。',
        '其实我明明知道，孤独是人类的常态，这种常态是恋爱，婚姻都无法解决的，我现在虽然没有女朋友，但是有一个室友，不至于一个人生活，可孤独感却没有褪减。今天早上起床，依然能强烈的感觉到，这种感觉让人十分难受，却又无可奈何。上一段时间，我也是十分渴望一份感情，似乎有了它我就可以从这种致命的孤独感中脱离出来，我的情感就会有一个寄托，不至于心里空落落的。可我其实也知道，就算找到了，也未必会有这样的效果，爱情本身并不常见，可孤独却是。就算找到了女朋友也无济于事，可我却十分渴望找一个女朋友，似乎找到了就能摆脱掉我身上的烦恼，摆脱掉这该死的，失落的感觉。',
        '我对自己能否找到伴侣一直没有太大的信心，之前自己总感觉自己在处理亲密关系方面颇具心得，自己身边的关系处理的还算到位，想必自己处理男女感情问题也是如此，可当自己对外界的了解越来越深后，发现并不是这样。从此我也发现了一些问题，我身边的女性对我好，没有怎么抱怨我，是因为我是她们的儿子，孙子，弟弟，她们对自己的丈夫并不如此。我十分害怕自己也处于这种境地，被不断的要求，不断的抱怨，永远都无法满足一个女性不断的，新增的对自己丈夫的需求。',
        '这似乎是一个无解的问题，毕竟我也没找到女朋友，没法判定，我也一直坚定的认为，个体的差异性比群体差异要大很多，两个人就算能在一起，也一定要经历磨合，在没有另一个人的情况下，我能做的只有和自己磨合，与自己和解。'
      ]
    },
    {
      title: '婚姻与爱情',
      date: 'don not',
      content: [
        '在我看来，婚姻和爱情是完全不一样的两个东西，婚姻的本质是维持社会可持续繁衍生息的方法，而爱情是繁殖，欲望的衍生物，是跟随本性的，恋爱时人们陷入的欢喜，悲痛，纠缠都是在自愿的情况下自发产生的行为，只要没有什么实质性的伤害，恋爱基本是没有约束的。恋爱的形式有很多，每个人都对恋爱有自己的想法，这种感觉十分美好，因为足够自由，当我们跟随着自身释放的多巴胺，无拘无束的释放自己的情感，不用想太多的后果，只需要在乎现在够不够爽就行了。所以这种无拘无束的生活方式才会千百年来被广大男男女女所向往，大家向往美好的爱情，可美好的爱情本身与长久是相斥的。每个年龄段的性激素分泌都不太一样，对爱情的定义也有很大的不同，不过，如果爱情这么被定义的话，婚姻应该也属于爱情的一部分，可是大部分人都没办法一生只爱一人，这不符合人性，不符合繁殖的特点。可以说恋爱的本质是繁殖的衍生物，所以说恋爱是人类永恒的主题是不为过的。不过人类毕竟和其他动物不一样，人类会自发的吸取教训，累积经验，至此婚姻便出现了。',
        '婚姻确实不是因为爱情而存在，因为如果只是爱情，婚姻可有可无，人类只需要像其他动物一样，由母亲扶养成人，然后雄性负责保护族群，以母性为纽带，也能很好的繁衍下去，只是不像现在这么发达罢了。婚姻的出现是维护社会关系而存在的，全世界不同的生活环境都出现了婚姻，而且都是父系氏族，母系氏族似乎没有养育出现代文明的案例。而且一夫一妻制也是如此，现代国家大都认可一夫一妻制，虽然这个制度也是近代才普及出来的，可这种制度无论是资本主义社会还是社会主义社会都统一认可。似乎这是目前为止最好的解决办法。可婚姻实际上是对欲望的克制，一个自然人，是不会一生只爱一人的，他/她会在人生的不同阶段做出不同的选择，不会始终如一，尤其是雄性，尽可能多繁衍自己的基因更是其本身的欲望之一。',
        ' 后续。。。'
      ]
    },
    {
      title: '婚姻与爱情 2',
      date: '2021-8-8',
      content: [
        '沿着上面的开始写，婚姻本身是具有社会属性的，是人对于如何处理两性关系的一种社会性的社会性的实践，并且能让大部分人都能接受，符合大部分人的利益和价值观，无论你在一场婚姻里面扮演什么角色，似乎这都能让人接受，因为它本身是具有很强的社会约束的，它会规定任何这场婚姻的有关人士，尤其是婚姻的对象，按照大家都能接受的方式，长期的生活在一起，并且为人类的繁衍做出贡献。这样的一个符合大多数人利益的社会性活动，自然会成为社会的主流。',
        '而爱情，则更自由一些，甚至不喜欢了，或者喜欢上第三者了，在爱情里都是一个很正常的事情，最多受到局部社会的指责，在中国，这样的道德标准可能会相对严格一点，但随着社会的发展，慢慢地，大家对谈恋爱本身的要求也会越来越低。对婚姻的要求反而会越来越高。但是无论是结婚的人，还是谈恋爱的人，其实都是同一批人，要求越高，愿意遵循的人便会越来越少，毕竟结婚受法律保护，但却要以一生为承诺。',
        '现在的人，对于恋爱似乎要比婚姻更加让人能够接受，离婚率也越来越高。毕竟对于一生的承诺，几乎不会有人不去重视，不去有所期望，但这是一个两个人，或者是两家人的活动，可控性并不高，符合自己要求的另一半更是需要多多筛选，这样一来，即使在冲动的年龄选择了结婚，在冷静下来后仍然会后悔的人大有人在，我们望着互联网中的美好画面，幻想着这些画面将会是自己的生活。殊不知，这种画面前面对着的可是摄像机，我们的生活，后面承担的，却是我们自己。',
        '最近的自己也处于一种正在以结婚为目的的恋爱之中，虽说有些牵强，但自己确实是这么想的。虽说结果不知如何，但还是希望愿意认真对待吧。我生来爱好自由，不愿自己束缚在婚姻，房价，豪车等等能锁住自己的“牢笼”之中，不过当自己真正开始经营一段感情的时候，才有了一些与之前想法不太一致的体验。人是十分脆弱的，自由的代价往往会高的离谱。昨天看到了戴建业老师解读纳兰性德的浣溪沙，这首词也是我很久之前就读过，昨晚读起来也是心有戚戚焉。这里把它给放一下。',
        '浣溪沙·谁念西风独自凉',
        '纳兰性德   清',
        '谁念西风独自凉？',
        '萧萧黄叶闭疏窗。',
        '沉思往事立残阳。',
        '被酒莫惊春睡重，赌书消得泼茶香。',
        '当时只道是寻常。',
        '读到这首诗，也羡慕纳兰性德和戴建业老师，也希望戴建业老师能够从丧妻之痛中走出来，美好的情感是热爱生活的基石。私以为，我在这段感情中能做到的也就是希望带给自己和对方一些美好的时光，也希望自己能够做到敢爱敢恨。这段感情我不确定自己能走到哪一步，而且对于结局其实也并没有很好的预想，也希望自己如果真的坚持不住的时候，不要无法自拔，能走出来，希望在我们相处的这段时间里，双方都能拥有一段美好的回忆。如果有希望走到一起，希望自己能够勇敢一些，走下去吧，如果大家都愿意，那就在一起吧。',
        '这首诗所想表达的，正是我对美好情感生活的向往，这种状态，是爱情和婚姻相结合的一种状态。虽说这是在美好结束后才写下的诗句，但美好的生活确实是真实存在的。这种真实的，美好的，坚硬的情感，正是我所向往的，之前看过一个电影《小偷家族》，描写那种美好，真实却不那么坚硬的情感，确实也让自己感动不已，但却不向往，而是为其真实的一面而感到一丝惆怅，和一些思考。我自然是还没有到‘当时只道是寻常’的状态，只能通过自己的同理心来体谅这种真挚的情感，这次接触后，我也成长了一些，至少理论上的东西运用在实际上就是一个巨大的成长。婚姻和爱情的结合，或者说异同。以及自己对于两者的期待，以及在期待中如何实现自己的行动，如何理清，如何对待自己无力的情况，都在这次接触中慢慢变得清晰起来。',
        '在一次情感经历中，美好的相处环境是我所追求的，即使后面无法在一起，在相处的过程中，也要努力让这段旅程变的美好，结果虽然让人向往，可这并不是可控的，我能控制的，就是在相处的时候，尽量让双方处于一种惬意，美好的环境之中，好好体验这段感情才是真正该做的。'
      ]
    },
    {
      title: '无题',
      date: '2021-5-18',
      content: [
        '又是很久没有写过笔记了，中间经历了很多，比如换工作，小外甥出生，还有一些琐事。总想着找个时间把东西记录下来，可一直也没啥闲暇时间，多余的时间不是用来打游戏，就是用来学习了。闲下来几乎只会想到这两个事，其他的似乎也没办法作为习惯存在，只能是偶尔想起，才会去做。',
        '写作对于我来说，十分的重要，无论是写关于编程的也好，随笔也好，总之需要写点什么，需要输出一些东西，把自己的思想凝固起来，现在我表达能力感觉不如以前了，说话时中心思想不明确，总是会考虑太多而无法表达重要的意思，其实表达被误解，语言的片面性都是真实存在且无法避免的，说话时没必要纠结细节，咬文嚼字，还是以表达中心思想为主。理清思路才是表达的重中之重。无需说的太全面，把主要思路说出来即可。思路要理清，说话把握中心，沟通首先就是，站在别人的角度表达自己的观点。',
        ' 我现在需要多输出一些东西，要以输出的方式来获取知识和能力，这将会是我后面很长一段时间需要致力于发展的一点，还有就是总结，每当灵光一现，便要记录下来，以免事后忘记。多输出，多记录，多总结。这便是我今后需要努力的方向，或许很多人在很小的时候就已经拥有这样的能力，我确实不如他们，不过现在开始也不算晚，最近这段时间我想了很多，发现自己的欲望并不算很强烈，这块也要改动，一切从我做的这个前端项目开始，我会尽力去优化自己的代码，从这个开始，来提升，修炼自己。我需要一些世俗的欲望，和面对这个现实世界的勇气。'
      ]
    }
  ]
}